Q1. List any five functions of the pandas library with execution.

1. read_csv()
This is one of the most crucial pandas methods in Python. read_csv() function helps read a comma-separated values (csv) file into a Pandas DataFrame. All you need to do is mention the path of the file you want it to read.
2. head()
head(n) is used to return the first n rows of a dataset. By default, df.head() will return the first 5 rows of the DataFrame. If you want more/less number of rows, you can specify n as an integer.
3. describe()
describe() is used to generate descriptive statistics of the data in a Pandas DataFrame or Series. It summarizes central tendency and dispersion of the dataset. describe() helps in getting a quick overview of the dataset.
4. to_datetime()
to_datetime() converts a Python object to datetime format. It can take an integer, floating point number, list, Pandas Series, or Pandas DataFrame as argument. to_datetime() is very powerful when the dataset has time series values or dates.
5. groupby()
groupby() is used to group a Pandas DataFrame by 1 or more columns, and p

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [1]:
import pandas as pd

In [3]:
data = {'a' : [11,22,33,44],
        'b' :['male','female','male','female'],
        'c' : [99,98,97,99]}
df = pd.DataFrame(data,index = [1,2,3,4])

In [4]:
df

    a       b   c
1  11    male  99
2  22  female  98
3  33    male  97
4  44  female  99

In [7]:
df.reindex([1,5,8,11])

       a     b     c
1   11.0  male  99.0
5    NaN   NaN   NaN
8    NaN   NaN   NaN
11   NaN   NaN   NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [10]:
import pandas as pd

In [12]:
data = {'values' : [10,20,30,40,50]
}
df = pd.DataFrame(data)

In [13]:
df

   values
0      10
1      20
2      30
3      40
4      50

In [15]:
for i in df.iterrows():
    print(i)

(0, values    10
Name: 0, dtype: int64)
(1, values    20
Name: 1, dtype: int64)
(2, values    30
Name: 2, dtype: int64)
(3, values    40
Name: 3, dtype: int64)
(4, values    50
Name: 4, dtype: int64)

In [17]:
df.head(3).sum()

values    60
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [26]:
pd.set_option("display.max_colwidth",1000)

df3 =pd.DataFrame({"desc" : ["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.","This course has been designed to help you become a complete and professional Java professional. This unique industrial program will teach you the entire Java Development process which helps to land jobs in top organizations by developing industry-ready projects. After completing this course, you will have a thorough understanding of various Data Structures and Algorithms with System Design in Java which will further enhance your career as a Java developer. This course will be taught in Hindi language.","Learn complete web stack programming with React and Node by doing it the way a full-stack professional would do it. Learn how to create whole web apps from start to finish with one of the most trending tech stacks available. You can learn how to create data-driven applications, as well as how to test, protect, and deploy your code, in this thorough study path. MERN stack is one of the most versatile tech stacks available. Learn front-end and server-side support, to build a multi-platform solution. This course will be taught in Hindi language."]})

In [27]:
df3["word_count"]=df3["desc"].apply(lambda x :len(x.split()))

In [28]:
df3

,desc,word_count
0,"Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.",104
1,"This course has been designed to help you become a complete and professional Java professional. This unique industrial program will teach you the entire Java Development process which helps to land jobs in top organizations by developing industry-ready projects. After completing this course, you will have a thorough understanding of various Data Structures and Algorithms with System Design in Java which will further enhance your career as a Java developer. This course will be taught in Hindi language.",78
2,"Learn complete web stack programming with React and Node by doing it the way a full-stack professional would do it. Learn how to create whole web apps from start to finish with one of the most trending tech stacks available. You can learn how to create data-driven applications, as well as how to test, protect, and deploy your code, in this thorough study path. MERN stack is one of the most versatile tech stacks available. Learn front-end and server-side support, to build a multi-platform solution. This course will be taught in Hindi language.",93

Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size()    := Return an int representing the number of elements in this object.
                       Return the number of rows if Series. Otherwise return the number of rows times number of columns if DataFrame.
                        >>> s = pd.Series({'a': 1, 'b': 2, 'c': 3})
                        >>> s.size
                        3
DataFrame.shape()   := Return a tuple representing the dimensionality of the DataFrame.
                        >>> df = pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})
                        >>> df.shape
                        (2, 2)

Q6. Which function of pandas do we use to read an excel file?

We can use the pandas module read_excel() function to read the excel file data into a DataFrame object.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [95]:
import pandas as pd

In [96]:
df = pd.DataFrame({'username': ['vaghasiya295@gmail.com', 'harshvaghasiya@yahoo.com', 'ashokbhai123@gmail.com']})

In [97]:
df

                   username
0    vaghasiya295@gmail.com
1  harshvaghasiya@yahoo.com
2    ashokbhai123@gmail.com

In [99]:
df["username"] = df.username.str.extract("(.*)@")

In [100]:
df

         username
0    vaghasiya295
1  harshvaghasiya
2    ashokbhai123

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [118]:
data = {'a' : [3,8,6,2,9],
        'b' :[5,2,9,3,1],
        'c' : [1,7,4,5,2]}
df = pd.DataFrame(data)

In [119]:
df

   a  b  c
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [120]:
df[(df['a'] >5) & (df['b']<10)]

   a  b  c
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [124]:
data = {'value' : [11,12,13,23,56,78,98,76,54]}
df = pd.DataFrame(data)

In [125]:
df

   value
0     11
1     12
2     13
3     23
4     56
5     78
6     98
7     76
8     54

In [126]:
df.mean()

value    46.777778
dtype: float64

In [127]:
df.median()

value    54.0
dtype: float64

In [128]:
df.std()

value    33.139017
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [22]:
import pandas as pd

In [23]:
df = pd.DataFrame({ "sales" : [500,400,500,2000,1000,2300,2600,7800],
                    "date" : ["2023-06-20" , "2023-06-21" , "2023-06-22","2023-06-23","2023-06-24","2023-06-25","2023-06-26","2023-06-27"]})

In [24]:
df

   sales        date
0    500  2023-06-20
1    400  2023-06-21
2    500  2023-06-22
3   2000  2023-06-23
4   1000  2023-06-24
5   2300  2023-06-25
6   2600  2023-06-26
7   7800  2023-06-27

In [40]:
df1["MovingAverage"] = df[["sales"]].rolling(window=7).mean()

In [41]:
df1

         sales  MovingAverage
0          NaN            NaN
1          NaN            NaN
2          NaN            NaN
3          NaN            NaN
4          NaN            NaN
5          NaN            NaN
6  1328.571429    1328.571429
7  2371.428571    2371.428571

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [58]:
df = pd.DataFrame({"date" : ["2023-01-01" , "2023-01-02" , "2023-01-03","2023-01-04","2023-01-05"]})

In [59]:
df

         date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [60]:
def week(x):
    if x ==  '2023-01-01':
        return "sunday"
    elif x == '2023-01-02':
        return "monday"
    elif x == '2023-01-03':
        return "tuesday"
    elif x == '2023-01-04':
        return "wednesday"
    elif x == '2023-01-05':
        return "thursday"
df["weekday"] = df['date'].apply(week)

In [61]:
df

         date    weekday
0  2023-01-01     sunday
1  2023-01-02     monday
2  2023-01-03    tuesday
3  2023-01-04  wednesday
4  2023-01-05   thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [76]:
df = pd.DataFrame({'dates':pd.date_range('2023-01-01 00:00:00','2023-01-31 12:30:12')})

In [77]:
df

        dates
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

import pandas as pd